---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.PartialFailureResults
source: html/e8c25aa2-8fca-83e8-14ac-0b7c29943caa.htm
---
# Autodesk.Revit.DB.Fabrication.PartialFailureResults

Possible results of the partial failure from invoking the DesignToFabricationConverter.

## Syntax (C#)
```csharp
public enum PartialFailureResults
```